---
kind: other
id: Methods.T:Autodesk.Revit.DB.RevolvedFace
source: html/709d7d6c-fd79-eee7-d5cb-51b9d7da82f0.htm
---
# RevolvedFace Methods

Returns the first partial derivatives of the underlying surface at the specified point.